import React, { useState } from "react";
import { motion, AnimatePresence } from "framer-motion";
import img1 from "../assets/leader-1.jpg";
import img2 from "../assets/leader-3.jpg";
import img3 from "../assets/leader-6.jpg";
import img4 from "../assets/leader-12.jpg";
import img5 from "../assets/leader-4.jpg";
import img6 from "../assets/leader-14.jpg";
import img7 from "../assets/leader-2.jpg";
import img8 from "../assets/leader-7.jpg";
import img9 from "../assets/leader-15.jpg";

const SuccessGallery = () => {
  const [selected, setSelected] = useState(null);

  const leaders = [
    {
      id: 1,
      name: "பேரரசர் கிருஷ்ணதேவராயர்",
      image: img1,
      desc: `விஜயநகரப் பேரரசின் பேரரசர்களிலே மிகவும் புகழ் பெற்றவர் ஆவார். இவரது ஆட்சிக் காலமே பேரரசின் மிக உயர்ந்த நிலை ஆகும். இவர், கன்னட மற்றும் தெலுங்கு மக்களிடையே பெரும் வீரனாக மதிக்கப்படுவதுடன், இந்தியாவின் பெருமைமிகு அரசர்களில் ஒருவருமாவார். இவர், ஆந்திர போஜன், கன்னட ராஜ்ய ராம ரமணன் என்றும் அழைக்கப்பட்டவர். இவரைப் பற்றிய தகவல்கள் பெரும்பாலும் போத்துக்கீசப் பயணிகளான, டொமிங்கோ பயஸ் (Domingos Paes), பெர்னாவோ நுனிஸ் (Nuniz) ஆகியோரின் எழுத்துக்கள் மூலமாகவே கிடைத்துள்ளன. இவர் துளுவ வம்சத்தை சேர்ந்த பேரரசர் ஆவார்.[2]

பேரரச பதவி
கிருஷ்ணதேவராயரின் தந்தை துளுவ நரச நாயக்கன். கிருஷ்ணதேவராயரின் தாத்தாவின் பெயர் துளுவ ஈஸ்வரா நாயக்கன், பேரரசன் சாளுவ நரசிம்ம தேவ ராயனிடம் தளபதியாக இருந்தவர். நரசிம்ம தேவ ராயன் இறந்த பின்னர் ஆட்சிக்கு வந்த அவரது மகனும் கொல்லப்பட்டான். சிறுவனாயிருந்த இன்னொரு மகனை அரசனாக்கி, பேரரசு சிதைந்துவிடாமலிருக்க அதன் நிர்வாகப் பொறுப்பைத் தன்கையில் எடுத்துக் கொண்டார் நரச நாயக்கன். ஆனால், நரச நாயக்கனுக்குப் பின் நிர்வாகப் பதவியை ஏற்றுக்கொண்ட அவரது மூத்த மகனும், கிருஷ்ணதேவராயரின் தமையனுமான வீரநரசிம்ம ராயன் சில காலத்தின் பின் தானே பேரரசராக முடிசூட்டிக் கொண்டார். கிருஷ்ணதேவராயர் அவருக்கு நிர்வாகத்தில் உதவியாக இருந்தார். வீரநரசிம்ம ராயன் இறந்த பின் கிருஷ்ணதேவராயருக்குப் பேரரச பதவி கிட்டியது. கிருஷ்ணதேவராயரின் முடிசூட்டுவிழா கிருஷ்ணனின் பிறந்தநாளில் நடைபெற்றது. திறமை வாய்ந்த முதன் மந்திரியாகிய திம்மராசன், கிருஷ்ணதேவராயருக்குப் பேரரசின் நிர்வாகத்தில் பெரும் உதவியாக இருந்தார். கிருஷ்ணதேவராயரை ஆட்சிபீடம் ஏற்றியதில் பெரும் பங்கு திம்மராசனையே சாரும். கிருஷ்ணதேவராயர் இவரை ஒரு தந்தையின் இடத்தில் மதித்து வந்தார்.

கிருஷ்ணதேவராயரின் மிகமுந்திய கல்வெட்டு 26 ஜூலை 1509 ஆம் ஆண்டு வெளியிடப்பட்டது. இவர், விஜயநகரத்துக்கு அருகில் தனது தாயின் நினைவாக அவரது பெயரால், நாகலபுரம் என்னும் புறநகர்ப் பகுதியைக் கட்டினார்.

ஆளுமை
இவரைப் பற்றி எழுதப்பட்டவற்றிலிருந்து, இவர் நடுத்தர உயரம் உடையவராக இருந்தார் என்றும், மகிழ்ச்சியான பண்புகளைக் கொண்டிருந்தார் என்றும் அறியப் படுகிறது. இவர் வெளிநாட்டு விருந்தினரை மதித்தார், சட்டத்தைப் பேணுவதில் கடுமையாக இருந்த இவர், அன்றாடம் பயிற்சி செய்வதன் மூலம் தனது உடற் தகுதியை உயர்ந்த நிலையில் வைத்திருந்தார். கிருஷ்ணதேவராயர் ஒரு சிறந்த நிர்வாகியாக மட்டுமன்றிச் சிறந்த தளபதியாகவும் விளங்கினார். தானே படைகளை முன்னின்று நடத்தியதோடு, காயமடைந்தவர்களுக்குத் தானே உதவும் பண்பும் அவரிடத்திற் காணப்பட்டது.

படையெடுப்புக்களும், வெளிநாட்டுத் தொடர்புகளும்
விஜயநகரப் படைகள் சென்ற இடமெல்லாம் வெற்றியைக் குவித்த, கிருஷ்ணதேவராயரின் ஆட்சிக்காலம், அப் பேரரசின் வரலாற்றில் பெருமைக்குரிய பகுதியாகும். சமயங்களில், இப் பேரரசர், போர்த் திட்டங்களைச் சடுதியாக மாற்றியமைப்பதன் மூலம், தோல்விகளை வெற்றிகளாக்கியதாகச் சொல்லப்படுகிறது. இவரது ஆட்சிக்காலத்தின் முதற் பத்தாண்டுகள் நீண்ட முற்றுகைகளும், இரத்தம் சிந்திய படை நடவடிக்கைகளும், வெற்றிகளும் கொண்டதாக இருந்தது. இவரின் முக்கிய பகைவர்களாக, சாளுவ நரசிம்ம தேவ ராயன் காலத்திலிருந்தே தொடர்ச்சியான சண்டைகளில் ஈடுபட்டிருந்த ஒரிசாவின் கஜபதிகள், ஐந்து துண்டாகப் பிரிந்து விட்டாலும் தொடர்ந்தும் பேரரசுக்கு நெருக்கடி கொடுத்துவந்த பாமினி சுல்தான்கள், வளர்ந்துவரும் கடல் வல்லரசாக இருந்துகொண்டு, கடல் வணிகத்தின் பெரும்பகுதியைக் கட்டுப்பாட்டில் வைத்திருந்த போத்துக்கீசர் ஆகியோர் இருந்தனர். உம்மாத்தூர்த் தலைவர்கள், கொண்டவிடு ரெட்டிகள், புவனகிரி வெலமாக்கள் என்போரும் இடையிடையே பேரரசுக்கு எதிராகக் கிளர்ச்சி செய்தனர்.

தக்காணத்து வெற்றிகள்
ஆண்டு நிகழ்வுகளாக இருந்த தக்காணத்துச் சுல்தான்களின் படையெடுப்புகளும், பேரரசின் நகரங்களை அழிப்பதும், கிருஷ்ணதேவராயர் காலத்தில் நின்றுவிட்டது. பொ.ஊ. 1509 ஆம் ஆண்டில், கிருஷ்ணதேவராயரின் படைகள், பீஜப்பூர் சுல்தானுடன் சண்டையில் ஈடுபட்டுச் சுல்தானைக் கடுமையாகக் காயப்படுத்தி அவனைத் தோற்கடித்தன. யூசுப் ஆதில் கான் கொல்லப்பட்டதுடன், கோல்கொண்டாவும் பேரரசுடன் இணைக்கப்பட்டது. இந்த வெற்றியையும், பாமினி அரசுகளின் ஒற்றுமை இன்மையையும் பயன்படுத்திக் கொண்ட கிருஷ்ணதேவராயர், பிதார் (Bidar), குல்பர்கா (Gulbarga), பீஜப்பூர் (Bijapur) ஆகியவற்றையும் கைப்பற்றினார். இச் சண்டையில் பிடிபட்ட சுல்தான் மஹ்மூதைப் பின்னர் விடுவித்துவிட்டார்.

உள்ளூர்த் தலைவர்களுடன் போர்
கிருஷ்ணதேவராயர் பல உள்ளூர்த் தலைவர்களான கொண்டவிடு ரெட்டிகள், புவனகிரி வெலமாக்கள் ஆகியோரை அடக்கி, கிருஷ்ணா ஆறு வரை இருந்த நிலப்பகுதிகளைக் கைப்பற்றிக் கொண்டார். 1512 இல் உம்மாத்தூர்த் தலைவன் கங்கராஜா, கிருஷ்ணராயனுடன் போரிட்டான். காவேரிக்கரையில் தோற்கடிக்கப்பட்ட கங்கராஜா காவிரியில் மூழ்கி மரணமானார். இப் பகுதி பின்னர் ஸ்ரீரங்கப்பட்டினத்துடன் இணைக்கப்பட்டது. 1516-1517 காலப்பகுதியில், கிருஷ்ணதேவராயர் கோதாவரி ஆற்றுக்கு அப்பாலும் சென்றார்.`,
    },
    {
      id: 2,
      name: "மாமன்னர் திருமலை நாயக்கர் ",
      image: img2,
      desc: ` மதுரையை ஆண்ட நாயக்க மன்னர்களுள் மிகவும் புகழ் பெற்றவராவார். இவர் கி.பி 1623 தொடக்கம் 1659 வரையான காலப்பகுதியில் ஆட்சிப்பொறுப்பில் இருந்தார். இவர் காலத்தில் டெல்லி சுல்தானின் படைகளாலும், மற்றும் அயலிலிருந்த முஸ்லிம் அரசுகளாலும் தொடர்ந்து பயமுறுத்தல்கள் இருந்து வந்தன. எனினும் அவற்றை முறியடித்துத் தனது நாட்டை இவர் சிதையாமல் காப்பாற்றினார். இவரது ஆட்சிப்பகுதிக்குள் பண்டைய பாண்டிநாட்டின் பெரும் பகுதி அடங்கியிருந்தது. 2016 ஆம் ஆண்டிலிருந்து, இவரது பிறந்தநாள் அரசு விழாவாக கொண்டாடப்படுகிறது.

ஆரம்பகாலம்
இவர் முத்துக் கிருஷ்ணப்ப நாயக்கர் மகனாக கி.பி 1584 ஆம் ஆண்டில் பிறந்தார். இவரது இயற்பெயர் திருமலை சவுரி நாயினு அய்யலுகாரு என்பதாகும். இவர் பலிஜா சமூகத்தை சேர்ந்தவர். முதலாம் முத்துவீரப்பர் சந்ததியின்றி இறந்தமையால் இவரது தம்பி திருமலை நாயக்கர் மதுரை நாட்டின் ஆட்சிப்பொறுப்பை ஏற்றார்.

ஆட்சிப் பகுதிகள்
திருமலை நாயக்கர் திருச்சிராப்பள்ளியிலிருந்து தலைநகரை மீண்டும் மதுரைக்கு மாற்றினார்.

ஆட்சியின் கீழ் இருந்த பகுதிகள்.
திருநெல்வேலி நாடு, திருவிதாங்கூர் ஆட்சிபகுதியின் ஒரு பகுதி இத்துடன் தமிழ்நாட்டில் உள்ள
மதுரை,
திண்டுக்கல்,
ராமநாதபுரம்,
சிவகங்கை,
புதுக்கோட்டை,
மணப்பாறை,
கோயம்புத்தூர்,
சேலம் மற்றும்
திருச்சிராப்பள்ளி போன்ற பகுதிகள் நாயக்க மன்னரால் ஆளப்பட்டன.
இங்கு குறிக்கப்பட்டுள்ள ஊர்கள், அந்த ஊர்களுடன் சேர்த்து அந்தந்த ஊர்களை தலைநகராக கொண்ட பகுதிகளையும் குறிக்கின்றன. இருப்பினும் இந்த பகுதிகள் திருமலை நாயக்கரின் ஆளுகையில் இருந்தாலும் இவற்றை நேரடியாக ஆட்சி செய்தவர்கள் அந்த பகுதிகளில் நியமிக்கப்பட்ட பாளிகார் என்றழைக்கப்படும் பாளையக்காரர்கள்தான்.
கட்டிடக்கலை

திருமலை நாயக்கர் அரண்மனை

நிறைவடையாத இராய கோபுரம்
தமிழக மக்கள் மறவாது நினைக்குமாறு மதுரையை விழாநகரமாகவும்,கலைநகரமாகவும் மாற்றியமைத்தார். திருமலை நாயக்கர், கட்டிடக்கலை உள்ளிட்ட கலைகள் மீது ஆர்வம் கொண்டு அவற்றின் வளர்ச்சிக்குப் பெரும் பங்களித்தார். பழைய கோயில்களைத் திருத்தி அமைத்தார். திருமலை நாயக்கர் மகால் என அழைக்கப்படும் அரண்மனை திருமலை நாயக்கரால் கி.பி. 1636 ஆம் ஆண்டில் கட்டுவிக்கப்பட்டது. புதுமண்டபம் கட்டி முடித்த பின்னர், இவரால் துவக்கப்பட்ட இராயகோபுரம் கட்டிடப் பணி முற்றுப் பெறாமலேயே உள்ளது.

மணிமண்டபம்
திருமலை நாயக்கர் திருவில்லிபுத்தூர் ஆண்டாள் தீவிரமான பக்தன். தினந்தோரும் ஆண்டாள் கோவில் உச்சிகால பூசை முடித்த பின் மதிய உணவு உட்கொள்வது வழக்கம். மன்னர் மதுரையில் இருக்கும்போது ஆண்டாள் கோவில் பூசை மணிஓசையை அறிந்துகொள்ள வழிநெடுக பல மணிமண்டபங்களை அமைத்தார்.

பட்டங்கள்
திருமலை நாயக்கரின் கல்வெட்டுகள் மற்றும் செப்பேடுகள் மூலம் அவருக்கு பல பட்டப் பெயர்கள் இருந்துள்ளமை அறியமுடிகிறது. செப்பேடுகளில் இவரின் பெயரின் முன்பாக கச்சி என இட்டு, "கச்சி திருமலை" என்றே அழைப்பது வழக்கமாக உள்ளது. 

மும்முரசறையும் முத்தமிழ் வினோதன்
தவனெறியுள்ளவன்
சத்தியவாசகன்
சிவநெறி தளைக்க திருநீறுமிட்டவன்
சொக்கநாதருக்கு முக்கிய குணவான்
கச்சியிலதிபதிபன்
உச்சிதபோஜன்
அச்சுத அரியின் மெச்சிய பாலன்
வங்கி நாராயணன்
மருவலர்கள் கண்டன்`,
    },
    {
      id: 3,
      name: "பேரரசி ராணி மங்கம்மாள் ",
      image: img3,
      desc: `இராணி மங்கம்மாள் (இறப்பு: அண். 1705) பெண்கள் முடி சூட்டி ஆட்சி செய்யாத நாயக்கர் மரபில் காப்பாட்சியாளராக இருந்து மதுரையை 1689 முதல் 1704 வரை ஆண்ட பெண்மணி ஆவார்.[1] மதுரையை ஆண்ட சொக்கநாத நாயக்கரின் மனைவி ஆவார். கணவர் இறந்ததும் தன் மகன் அரங்க கிருஷ்ண முத்துவீரப்ப நாயக்கர் இளம் வயதினனாக இருந்த காரணத்தால் மகனுக்குத் துணையாகக் காப்பாட்சியாளராக இருந்து மதுரையை ஆண்டவர். திறமையான ஆட்சியாளர். சமயப் பொறை மிக்கவர். எதிர்ப்புகளைத் தன் ஆற்றலாலும் அறிவு நுட்பத்தாலும் முறியடித்தவர். 18 ஆண்டு காலம் தென்னாட்டை தனியே ஆண்ட பெண்ணரசி. இவருடைய ஆட்சி காலத்தில் மதுரை நாயக்கர்களின் தலைநகரமாக திருச்சிராப்பள்ளி விளங்கியது.

வரலாறு
இராணி மங்கம்மாள், மதுரையை ஆண்ட சொக்கநாத நாயக்கரிடம் (1659 -1682) தளபதியாக இருந்த தப்பகுள லிங்கம நாயக்கரின் மகளாவார்.[2] சொக்கநாத நாயக்கர் மங்கம்மாவைத் திருமணம் செய்து கொண்டார். ஆயினும் அவரை இராணியாகப் பட்டம் சூட்டவில்லை. தஞ்சாவூரை ஆண்ட விஜயராகவ நாயக்கரின் மகளைத் திருமணம் செய்ய சொக்கநாத நாயக்கர் நினைத்தார். ஆனால், அது தோல்வியில் முடிந்தது. 1682 ஆம் ஆண்டில் சொக்கநாத நாயக்கர் இறந்தபோது அரங்க கிருஷ்ண முத்துவீரப்ப நாயக்கர் மூன்று மாத குழந்தை. எனவே, தன் மகனைக் காக்க வேண்டி உடன் கட்டை ஏறாத மங்கம்மாள் ஆட்சிப் பொறுப்பினை காப்பாளராக ஏற்றார்.

அரங்க கிருஷ்ண முத்துவீரப்ப நாயக்கர்
மங்கம்மாள் தனது மகன் அரங்க கிருஷ்ண முத்துவீரப்ப நாயக்கருக்கு சின்னமுத்தம்மாள் என்பவரைத் திருமணம் செய்வித்தார். அதன் பிறகு அவருக்கு முடி சூட்டினார். அன்னையின் உதவியோடும் அறிவுரைகளோடும் அரங்க கிருஷ்ண முத்துவீரப்ப நாயக்கர் திறமையாக ஆட்சி செய்தார் . தந்தை சொக்கநாத நாயக்கர் இழந்த பகுதிகள் சிலவற்றை போரிட்டு மீட்டார். ஏழாண்டு காலம் நல்வழியில் ஆட்சி செய்து வந்த அரங்க கிருஷ்ண முத்துவீரப்ப நாயக்கர் பெரியம்மை நோயால் 1688ஆம் ஆண்டில் காலமானார். கணவர் இறந்த சிறிது நாளிலேயே ஆண்மகனைப் பெற்றெடுத்த சின்ன முத்தம்மாள் கணவரின் பிரிவு தாங்காமல் குளிக்க பயன்படுத்தும் பன்னீர் கலந்த நீரை அளவுக்கு அதிகமாக குடித்து ஜன்னி கண்டு உயிரிழந்தார். அம்மன்னரின் மகனான விஜயரங்க சொக்கநாதருக்குப் பெயரளவில் பட்டம் சூட்டப்பட்டது. அவர் சார்பில் அவருடைய பாட்டியும், சொக்கநாத நாயக்கரின் மனைவியுமான மங்கம்மாள் காப்பாட்சியராக பதவி ஏற்றுக்கொண்டு, இராணி மங்கம்மாள் என்ற பெயரில் 1706 வரை ஆட்சி நடத்தினார்.

இராணி மங்கம்மாளின் ஆட்சி
மங்கம்மாள் ஆட்சிப் பொறுப்பை ஏற்ற காலத்தில் போர்கள் அதிகம் நடைபெறவில்லை. இவர் அண்டையில் உள்ள அரசுகளிடம் நட்புறவையே விரும்பினார். ஆயினும் தஞ்சை மராத்தியர்கள், முகலாயர்கள், திருவாங்கூர் அரசு, போன்றவர்களால் சவாலைச் சந்திக்க வேண்டி இருந்தது. மிகத்திறமையான இராச தந்திரியாகவும் தேர்ந்த அரசியல் அறிவும் பெற்ற மங்கம்மாள் இப்பகைகளை மிகத்திறமையுடன் முறியடித்தார். ஆட்சி காலத்தில் நல்ல பல திட்டங்களைத் தீட்டி மதுரையைச் சிறப்பாக ஆண்டார்.

முகலாயர்களுடனான உறவு
முகலாயப் பேரரசர் ஔரங்கசீப், தக்காணம் வரை தனது பேரரசை விரிவு செய்யும் நடவடிக்கைகளைத் தீவிரப்படுத்திக்கொண்டிருந்தார். செஞ்சிக் கோட்டையில் பதுங்கி இருந்த மராத்திய மன்னன் இராசாராமைக் கைது செய்ய, தம் தளபதி 'சல்பீகார் அலிகான்' என்பவரை அனுப்பினார். சல்பீகார் அலிகான் சுமார் ஏழாண்டு காலம் செஞ்சிக்கொட்டையை முற்றுகையிட்டான். முற்றுகை நடந்து கொண்டிருக்கும் போதே மற்ற தமிழக அரசுகளைப் பணிய வைத்துத் திறைப்பொருளைச் செலுத்த படைகளை அணுப்பினான். மைசூர் மன்னரும் தஞ்சை மராத்தியரும் பணிந்து திறை செலுத்தினர்.

இராணி மங்கம்மாளும் முகலாயர் படை வலிமையையும் தன் படை வலிமையியும் நன்குணர்ந்து முகலாயருக்குப் பணிந்துபோக முடிவு செய்தார். விலையுயர்ந்த பொருள்களை தளபதி சல்பீகார் அலிகானுக்கு அன்பளிப்பாக அனுப்பி போரைத் தவிர்த்தார். பின் முகலாயர்களின் உதவியால், மராத்தியர்களிடம் இழந்த சில பகுதிகளை மீட்டார். உடையார்பாளையச் சிற்றரசர் கைப்பற்றியிருந்த மதுரையின் பகுதிகளையும் மீட்டார்.

திருவிதாங்கூர்ப் போர்
மதுரை நாயக்க அரசுக்கு உட்பட்ட சிற்றரசாக அப்போது திருவிதாங்கூர் அரசு இருந்தது. திருவிதாங்கூர் மன்னர் இரவி வர்மா, மதுரை நாயக்க அரசுக்கு செலுத்த வேண்டிய திறைப்பொருள்களைச் செலுத்தவில்லை. மேலும் கல்குளம் பகுதியில் இருந்த நாயக்கர் படையையும் தாக்கி அழித்தான். எனவே, தளவாய் நரசப்பையா என்பவர் தலைமையில் மங்கம்மாள் அனுப்பிய படை திருவிதாங்கூர் படையைத் தோற்கடித்தது. திறைப்பொருளாக பொன், பீரங்கி முதலிய பொருள்களையும் பெற்றுத் திரும்பியது.

தஞ்சைப் போர்
தஞ்சையை ஆண்ட மராத்தியருக்கும் மதுரை நாயக்கர்களுக்குமிடையில் நல்லுறவு நிலவவில்லை. தஞ்சை மராத்திய மன்னர் ஷாஜி, மதுரை நாயக்க மன்னர்களின் ஆட்சிப் பகுதிகள் சிலவற்றைக் கைப்பற்றிக் கொண்டார். இராணி மங்கம்மாள் தளவாய் நரசப்பையரை படைகளுடன் அனுப்பி அப்பகுதிகளை மீட்டார். அப்படை தஞ்சையை அச்சுறுத்தியது. எனவே தஞ்சை அமைச்சர் பாலாஜி பண்டிதர் இராணி மங்கம்மாளின் படைகளுக்குப் பெரும் பொருள் கொடுத்து அனுப்பினார்.

மைசூர்ப் போர்
முகலாய அரசு தக்கானத்தை தன் ஆட்சியின் கீழ் கொண்டு வர நினைத்த அதே வேளையில் மைசூர் மன்னன் சிக்க தேவராயன் தனது ஆட்சியை விரிவாக்க எண்ணி மதுரையின் ஆளுகைக்குக் கீழ் இருந்த சேலம் மற்றும் கோயமுத்தூரைக் கைப்பற்றினான். 1695ஆம் ஆண்டில் திருச்சிராப்பள்ளி கோட்டையையும் முற்றுகையிட்டான். இராணி மங்கம்மாளின் படைகளால் அம்முற்றுகை முறியடிக்கப்பட்டது.

சிக்கதேவராயன் தஞ்சை மற்றும் திருச்சிக்கு நீர் ஆதாரமாக விளங்கும் காவிரி நதியின் குறுக்கே தற்போது கண்ணம்பாடி அணை (Krishna Raja Sagar - KRS) உள்ள பகுதியில் அணை கட்டி அதனைத் தடுக்க எண்ணினான். அப்போது மங்கம்மாள் 1700ஆம் ஆண்டில் தஞ்சையுடனான பகையை மறந்து அதனுடன் ஒப்பந்தம் செய்து கொண்டு, தஞ்சை- மதுரைக் கூட்டுப்படை ஒன்றை உருவாக்கினார். படை கிளம்பும் வேளையில் மைசூர்ப் பகுதிகளில் கடும் மழை பெய்ததால் சிக்க தேவராயன் கட்டிய அணை உடைந்தது. சிக்கல் எதுவும் இல்லாமல் இப்பிரச்சினை தற்காலிகமாக முடிவடைந்தது.

ராமநாதபுரம் போர்
இராணி மங்கம்மாளின் முதலும் கடைசியுமான மிகப்பெரிய தோல்வியாக இராமநாதபுரம் போர் இருந்தது. மதுரைக்கு எதிராகவும் தஞ்சைக்கு ஆதரவாகவும் ராமநாதபுரம் மன்னர் ரகுநாத சேதுபதி இருந்ததால் 1702 ல் ரகுநாத சேதுபதிக்கு எதிராக இராணி மங்கம்மாள் தனது படைகளை அனுப்பினார். இந்த போரில் மதுரையின் தொடர் வெற்றிகளுக்குக் காரணமான தளவாய் நரசப்பைய்யா வீர மரணம் அடைந்தார். இது போரின் தோல்விக்கு மிக முக்கியக் காரணமாக அமைந்தது.

மங்கம்மாளின் சமயப் பொறை
மதுரை நாயக்கர்களைப் போலவே மங்கம்மாளும் சமயப் பொறையைக் கடைப் பிடித்தார்." ஒவ்வொருவரும் தாம் சிறந்ததாகக் கருதும் சமயத்தைப் கைக்கொண்டு வாழ்வதே தருமம் " என்ற கொள்கையைக் மங்கம்மாள் பின்பற்றினார். மதுரை மீனாட்சி அம்மனுக்கு பல்லக்கு மற்றும் பொன்னணிகள் பலவற்றை வழங்கினார். ஆனித்திங்களில் ஊஞ்சல் திருவிழா நடத்த ஏற்பாடு செய்தார். மதுரை மீனாட்சியம்மன் கோவிலில் விழாக்கள் நடைபெறும்போது, இராணி மங்கம்மாள் தமது செங்கோலை அம்மனின் முன்வைத்து வழிபடுவதை வழக்கமாகக் கொண்டிருந்தார். சித்திரை முழுமதி நாளில் இராணி மங்கம்மாளும் இளவரசரும் தமுக்கம் அரண்மனையில் தங்கி, மீனாட்சி திருமணத்தைக் கண்டு களித்தனர். ஆற்றில் இறங்கும் கள்ளழகரை அவர்கள் இருவரும் வழிபட்டனர்.

தான் ஒரு இந்துவாக இருந்த போதும் கிறிஸ்துவர் மற்றும் இசுலாமியர்களையும் மதித்தார். கிறித்துவ மத குருமார்களை சமயப் பேருரை செய்ய அனுமதி அளித்தார். சமயத் தொடர்பாக சிறை வைக்கப்பட்டிருந்த 'மெல்லோ' பாதிரியாரை விடுதலை செய்ததோடு, 'போசேத்' என்ற குருவைத் தம் அரசவையில் வரவேற்று விருந்தோம்பினார்.

இசுலாமியர்களுக்கும் மங்கம்மாள் மானியம் அளித்தார். 1701-ல் இசுலாமியர்களின் நல்வாழ்விற்காகவும் பள்ளிவாசல் பாதுகாப்பிற்காகவும் திருச்சியிலுள்ள நிலங்களை மானியமாக வழங்கியது குறித்துக் கல்வெட்டு கூறுகிறது

இராணி மங்கம்மாளின் அறப்பணிகள்
இராணி மங்கம்மாள் மக்கள் நலம் பேணும் பல அறச் செயல்களைச் செய்தார். மதுரையில் பெரியதொரு அன்னச்சத்திரம் அமைத்தார். அது 'மங்கம்மாள் சத்திரம்' என இன்றும் அழைக்கப்படுகிறது. புதிய சாலைகள் பலவற்றை அமைத்தார். கன்னியாகுமரிக்கும் மதுரைக்கும் இடையே அமைந்த நெடுஞ்சாலை மங்கம்மாள் சாலை என அழைக்கப்படுகிறது. குதிரைகள், பசுக்கள், காளைகள் முதலியவை நீர் அருந்துவதற்காக சாலையோரங்களில் தண்ணீர்த் தொட்டிகள் அமைக்க ஆணையிட்டார். பொது மக்களுக்காக குடிநீர் ஊருணிகள், கிணறுகள் ஆகியவற்றைத் தோண்டச்செய்தார். தொழில் வளர்ச்சி, வாணிகம், மக்கள் தொடர்பு ஆகியவற்றிற்கு வழிவகுத்தார். கொள்ளிடத்தில் வெள்ளம் ஏற்பட்டு மக்கள் துன்புற்ற போது அவர்களுக்கு உணவு, உடை, வீடு மற்றும் பாதுகாப்பு வசதிகளை வழங்குவதற்கு ஆணையிட்டார். வெள்ளத்தால் அழிந்த கரையோரத்துச் சிற்றூர்களையும் சீரமைத்தார். தற்போது மகாத்மா காந்தி அருங்காட்சியகமாக விளங்கும் தமுக்கம் அரண்மனையே இராணி மங்கம்மாளின் கோடைக்கால அரண்மனையாகும். இதிலுள்ள தமுக்கம் மைதானத்தில் தான் அக்காலத்தில் யானைச் சண்டை முதலான பொழுதுபோக்கு விளையாட்டுகளும் அரச விழாக்களும் நடைபெற்றன.


இராணி மங்கம்மாளின் கோடைக்கால அரண்மனை தற்போது மகாத்மா காந்தி அருங்காட்சியகம்
இறுதிக்காலம்
மிகத்திறமையாக ஆட்சி செய்த இராணி மங்கம்மாளால் தனது பேரனான விஜயரங்க சொக்கநாத நாயக்கருடன் நேரம் செலவழிக்க இயலாமல் போனது. எனவே, தவறான வழிகாட்டுதலின் பேரில் விஜய ரங்க சொக்கநாத நாயக்கர் இராணி மங்கம்மாளைத் தனது எதிரியாகக் கருதினார். எனவே தனது பெயரனாலேயே அவர் சிறையிலிடப்பட்டார். ,இதுவே அவரது வாழ்நாளின் இறுதியாயிற்று இராணி மங்கம்மாள் 1706- ல் இவ்வுலகை விட்டு மறைந்தார்.`,
    },
    {
      id: 4,
      name: "மன்னர் ரகுநாத நாயக்கர்",
      image: img4,
      desc: `இரகுநாத நாயக்கர் (கி.பி.1600 – 1645) இவர் தஞ்சாவூரைத் தலைநகரமாகக் கொண்டு சோழமண்டலத்தை ஆண்டு வந்த தஞ்சாவூர் நாயக்கவம்சத்தின் மூன்றாவது மன்னன்.

வம்சம்
இரகுநாத நாயக்கரின் தந்தை அச்சுதப்ப நாயக்கர் (1560–1600). தஞ்சையை ஆண்ட நாயக்கர்களில் தனிச்சிறப்புடையவராக விளங்கியவர் இரகுநாத நாயக்கர். இவர் தம்முடைய தந்தையின் மறைவிற்குப் பின்பு கி.பி.1617இல் முறைப்படி தஞ்சை நாயக்கர் ஆட்சிப் பொறுப்பு முழுவதையும் ஏற்றுக் கொண்டார்.இரகுநாத நாயக்கரின் மகன் விஜயராகவ நாயக்கர் (கி.பி.1633 – 1673).

ஆட்சிப்பகுதி
இவர் தமது ஆட்சிக்காலத்தில் ஈழத்தின் மீது படையெடுத்துச் சென்று வெற்றி கண்டார். ஈழத்தில் வெற்றி பெற்ற பிறகு தஞ்சையை நோக்கித் திரும்பும் வழியில் தோப்பூர் என்னும் இடத்தில் ஜக்கராயன் என்பவனோடு போரிட்டார். ஜக்கராயன் விசயநகரப் பேரரசுக்கு உட்பட்ட கோலார் பகுதியை ஆண்டு வந்தவன் ஆவான். இவன் விசயநகரப் பேரரசைக் கவரச் சதி செய்தான். இதனை யாசம நாயக்கர் என்ற குறுநில அரசர் அறிந்தார். இவர் விசயநகரப் பேரரசின் விசுவாசி ஆவார். யாசம நாயக்கர் ஒரு பெரும்படை திரட்டிச் சென்று ஜக்கராயனோடு போரிட்டார். போர் கல்லணைக்கு அருகில் உள்ள தோப்பூர் ( தற்போது அது தோகூர் என்றழைக்கப்படுகிறது) என்னும் இடத்தில் கி.பி.1616இல் நடைபெற்றது. இப்போரில் ஜக்கராயனுக்கு மதுரை, செஞ்சி நாயக்கர்கள் துணைநின்றனர். ஜக்கராயன் செஞ்சி, மதுரை நாயக்கர்களோடு சேர்ந்து கொண்டு தஞ்சைக்கு மேற்கே உள்ள கல்லணையை இடிக்க முற்பட்டான். இதனை அறிந்த இரகுநாத நாயக்கர் பெரும்படையுடன் சென்று தோப்பூர் என்னும் இடத்தில் ஜக்கராயன் படைகளோடு பெரும்போர் செய்தார். ஜக்கராயனுக்குத் துணைநின்ற மதுரை நாயக்கரும், செஞ்சி நாயக்கரும் தோல்வியுற்றுப் போர்க்களம் விட்டோடினர். ஆனால் ஜக்கராயன் போரில் கொல்லப்பட்டான். இரகுநாத நாயக்கர் மாபெரும் வெற்றி பெற்றார். தோப்பூர்ப் போர் வரலாற்றுச் சிறப்பு மிகுந்த போராகக் கருதப்படுகிறது. இரகுநாத நாயக்கர் தம் முன்னோர் போல, விசயநகரப் பேரரசிற்கு ஆதரவாளராகவே இருந்தார்.

வாணிபம்
இரகுநாத நாயக்கர் காலத்தில் டச்சு, டென்மார்க், இங்கிலாந்து, போர்த்துகீசு வாணிகர்கள் தஞ்சைக்கு வருகை புரிந்து வாணிபத்திற்காகப் போட்டியிட்டனர். டென்மார்க் நாட்டவர் தரங்கம்பாடி என்னும் சிறு துறைமுகப்பட்டினத்தில் தங்கி வாணிபம் செய்ய இரகுநாத நாயக்கர் அனுமதி வழங்கினார். இரகுநாத நாயக்கர் டென்மார்க் நாட்டவரோடு கொண்ட நட்புறவால் வாணிபம் நடைபெற்றது.

தஞ்சாவூர் வீணை
தஞ்சாவூரில் வீணை முதன்முதலாக இம்மன்னர் காலத்தில் முதன் முதலில் செய்யப்பட்டது. ஆகவேதான் தஞ்சாவூர் வீணை என்றும் இரகுநாத வீணை என்றும் பெயர் பெற்றது.`,
    },
    {
      id: 5,
      name: "மாவீரன் வீரபாண்டிய கட்டபொம்மன் ",
      image: img5,
      desc: `வீரபாண்டிய கட்டபொம்மன்  (3 சனவரி 1760 - 16 அக்டோபர் 1799), தமிழகத்தில், ஆங்கிலேயர் ஆட்சியை எதிர்த்துப் போரிட்ட 18-ஆம் நூற்றாண்டைச் சேர்ந்த பாளையக்காரர் ஆவார்.

இவர் தெலுங்கு மொழி பேசும் ராஜகம்பளம் நாயக்கர் இனத்தில் பிறந்தவர். இவருடைய முன்னோர்கள் முகமதியர்களின் படையெடுப்புக்குப்பின்பு கம்பிளி ராஜ்ஜியம் இழந்து விஜயநகரம் உருவாக்கினர். பின் சோழ நாட்டிலும், பாண்டிய நாட்டிலும் வாழ்ந்து வந்தனர். பின்பு முகமதியர்கள் சேர, சோழ, பாண்டிய மன்னர்களின் மீது தாக்குதல் நடத்தி நாட்டை கைப்பற்றி 50 ஆண்டுகள் ஆட்சி நடத்தினர். பாண்டிய நாட்டில் கோவில்கள் இடிக்கப்பட்டன. மதுரை மீனாட்சியம்மன் கோவில் அடைக்கப்பட்டது. விஜயநகரப் பேரரசின் படைகள் வந்து, அவர்கள் 3 நாடுகளையும் கைப்பற்றினர். பின்பு பாஞ்சாலங்குறிச்சியை ஆண்ட பாண்டிய மன்னன், வீர பாண்டிய கட்ட பொம்மு முன்னோர்களின் வீரத்தைப் போற்றி பாஞ்சாலங்குறிச்சியைப் பரிசாக வழங்கினார்.

கட்டபொம்மன் பெயர் காரணம்
அழகிய வீரபாண்டியபுரம் எனும் ஊரில் (இன்றைய ஒட்டப்பிடாரம்) ஆட்சிபுரிந்து வந்த ஜெகவீரபாண்டியனின் (நாயக்க வம்சம்) அவையில் அமைச்சராகப் பொம்மு என்கிற கெட்டி பொம்மு (தெலுங்கு) இடம்பெற்றிருந்தார். இவரது பூர்வீகம் ஆந்திர மாநிலம், பெல்லாரி ஆகும். வீரமிகுந்தவர் என்ற பொருளைத் தெலுங்கில் உணர்த்தும் கெட்டி பொம்மு எனும் சொல் நாளடைவில் கட்டபொம்மு என்று மாறி, பின் தமிழில் கட்டபொம்மன் என்ற சொல்லாயிற்று.[3] ஜெகவீரபாண்டியனின் மறைவிற்குப்பின், அரசகட்டிலில் ஏறிய கட்டபொம்மு பின், ஆதி கட்டபொம்மன் என்று மக்களால் அழைக்கப்பட்டார். இவரே பொம்மு மரபினரின் முதல் கட்டபொம்மன் ஆவார்.[3]

இந்த பொம்மு மரபில் வந்தவர்களே (திக்குவிசய கட்டபொம்மன்) ஜெகவீர கட்டபொம்மன், ஆறுமுகத்தம்மாள் தம்பதியர். இவர்களின் புதல்வரே வீரபாண்டியன் எனும் இயற்பெயர் கொண்ட வீரபாண்டிய கட்டபொம்மனாவார். இவர் நாயக்க வம்ச அரசாட்சியில் தொடர்ந்து வருவதால் பொம்மு நாயக்கர் என்று மக்களால் அழைக்கப்பட்டார்.[3]

வாழ்க்கை

மதுரையில் நிறுவப்பட்டுள்ள கட்டபொம்மன் சிலை
சனவரி 3, 1760 அன்று ஆறுமுகத்தம்மாள் - திக்குவிசய கட்டபொம்மு தம்பதியருக்கு, பாஞ்சாலங்குறிச்சியில் பிறந்தவர் வீரபாண்டிய கட்டபொம்மன். பெப்ரவரி 2, 1790 அன்று 47 வது பாளையக்காரராகப் பொறுப்பு ஏற்றுக்கொண்டார். அப்போது அவருக்கு வயது முப்பது ஆகும். வீரபாண்டிய கட்ட பொம்மனுக்கு குமாரசாமி என்ற ஊமைத்துரை, துரைச்சிங்கம் என்ற இரு சகோதரர்களும், ஈசுவர வடிவு, துரைக்கண்ணு என்ற இரு சகோதரிகளும் இருந்தனர். இவரது துணைவியார் சக்கம்மாள். இவர்களுக்குப் பிள்ளைப் பேறு இல்லை. இவர் 9 ஆண்டுகள், 8 மாதம், 14 நாட்கள் அரசுப் பொறுப்பிலிருந்தார்.

போர்
கருநாடக பிரதேசத்தின் ஆட்சியாளர்களான ஆற்காடு நவாப்புகள், பாளையக்காரர்களிடம் வரி வசூலிக்கும் உரிமையை கும்பினியாரிடம் ஒப்படைத்தனர். அதன்படி நெல்லை சீமையில் வரிவசூலிக்கும் பொறுப்பை ஏற்றிருந்த ஆங்கிலேய தளபதி மாக்ஸ்வெல் பாஞ்சாலங்குறிச்சி பாளையத்தாரர் வீரபாண்டிய கட்டபொம்மனிடம் வரிவசூலிக்க முடியாமல் இருந்தார். இதனடிப்படையில் கி.பி. 1797 இல் முதன் முதலாக ஆங்கிலேய தளபதி ஆலன் துரை, பாஞ்சாலங்குறிச்சிக் கோட்டைக்குப் பெரும்படையுடன் போரிட வந்தார். 1797 - 1798 இல் நடந்த முதல் போரில் கோட்டையைத் தகர்க்க முடியாமல் வீரபாண்டிய கட்டபொம்மனிடம் ஆலன் துரை தோற்று ஓடினார். அதன் பின்னர் நெல்லை மாவட்டக் கலெக்டர் ஜாக்சன் துரை வீரபாண்டிய கட்ட பொம்மனைச் சந்திக்க அழைத்தார். கட்டபொம்மனை அவமானப்படுத்த நினைத்து வேண்டுமென்றே பல இடங்களுக்கு வரச்சொல்லி சந்திக்காமல் அலைக்கழித்தார். இறுதியில் செப்டம்பர் 10, 1798 இல் இராமநாதபுரத்தில் சந்தித்தார். அப்போது தந்திரத்தால் வீரபாண்டிய கட்டபொம்மனைக் கைது செய்ய முயன்றார். அதை முறியடித்து வீரபாண்டிய கட்டபொம்மன், மீண்டும் பாஞ்சாலங்குறிச்சியை வந்தடைந்தார். செப்டம்பர் 5, 1799 இல் பானர்மென் என்ற ஆங்கிலேயத் தளபதியால் பாஞ்சாலங்குறிச்சிக் கோட்டை முற்றுகையிடப்பட்டது. அங்கு கடும் போர் நடைபெற்றது. போரில் பல ஆங்கிலேயர்கள் உயிரிழந்தனர். இருப்பினும் கோட்டை வீழ்ந்துவிடும் என்ற நிலையில், வீரபாண்டிய கட்டபொம்மன் கோட்டையை விட்டு வெளியேறினார்.

மரணம்

வீரபாண்டிய கட்டபொம்மனை கயத்தாற்றில் தூக்கிலிடப்பட்ட நினைவிடத்தின் முழு தோற்றம்

உள்ளே அமைந்துள்ள நினைவுத்தூண் உள்ள படிமம்
செப்டம்பர் 9 1799 இல் ஆங்கிலேயர்களால், பாஞ்சாலங்குறிச்சி கோட்டை கைப்பற்றப்பட்டது. அக்டோபர் 1, 1799 இல் புதுக்கோட்டை மன்னர் விஜயரகுநாத தொண்டமானால், வீரபாண்டிய கட்டபொம்மன் கைது செய்யப்பட்டு கும்பினியாரிடம் (கிழக்கிந்திய கம்பெனி) ஒப்படைக்கப்பட்டார். அக்டோபர் 16 1799 இல் ஆங்கிலேயத் தளபதி பேனர்மேன் ஆணைப்படி கயத்தாற்றில் தூக்கிலிடப்பட்டு, கொலை செய்யப்பட்டார்.

மீண்டும் எழுந்த பாஞ்சாலங்குறிச்சிக் கோட்டை
ஆங்கிலேயர்களால் பாளையங்கோட்டைச் சிறையில் அடைக்கப்பட்டிருந்த கட்டபொம்மனின் சகோதரர் ஊமைத்துரை பிப்ரவரி 02, 1801 அன்று பாஞ்சாலங்குறிச்சி வீரர்களால் மீட்கப்பட்டார். பாஞ்சாலக் குறிச்சிக் கோட்டைக்குப் புத்துயிர் கிடைத்தது. ஊமைத்துரையைக் கைது செய்ய வந்த மேஜர் மெக்காலே கோட்டையினுள் செல்ல முடியாமல் திரும்பினார். அவர் தலைமையில் ஒரு பெரும்படை மார்ச் 30, 1801இல் கோட்டையை முற்றுகையிட ஆரம்பித்து, மே 24, 1801இல் அதனைக் கைப்பற்றியது. அங்கிருந்து தப்பித்து, காளையார் கோவில், விருப்பாட்சி, திண்டுக்கல், பிரான்மலை என்று ஓடிய ஊமைத்துரையும், அவர் தம்பி துரைசிங்கமும், கைது செய்யப்பட்டு பாஞ்சாலங்குறிச்சி பீரங்கி மேட்டில் தூக்கிலிடப்பட்டனர். பாஞ்சாலங்குறிச்சி என்கிற பெயரையே தமிழகத்தின் வரைபடத்திலிருந்து நீக்கினர் வெள்ளையர். கோட்டை முற்றிலும் தகர்க்கப்பட்டுத் தரைமட்டமாக்கப்பட்டது.

1974 ஆம் ஆண்டு பாஞ்சாலங்குறிச்சியில் பழங்காலத்துக் கோட்டையின் வடிவினை ஒத்த ஒரு கோட்டையினை அப்போதைய தமிழக முதல்வராக இருந்த மு. கருணாநிதி எழுப்புவித்தார். அது இன்றளவும் வீரபாண்டியனின் புகழ்பாடி நிற்கிறது. கோட்டை, கொத்தளம், கொலுமண்டபம், ஜக்கம்மா தேவி ஆலயம் அனைத்தும் மீண்டும் தோன்றின. நினைவுக் கோட்டையை உள்ளடக்கிய 6 ஏக்கர் பரப்பினைச் சுற்றி மதில் சுவர் எழுப்பப்பட்டுள்ளது. உள்ளே தொல்பொருள் ஆய்வு மையமும் உள்ளது. மண்டபத்தின் உள்ளே கட்டபொம்மனின் வீரவரலாறு ஓவியங்களாகத் தீட்டப்பட்டுள்ளன. இக்கோட்டை 1977 முதல் சுற்றுலாத் துறையின் பராமரிப்பில் இயங்கி வருகிறது.

தற்போது 35 ஏக்கர் பரப்பிற்கு மேல் உள்ள பழைய கோட்டையின் அடிப்பகுதிக் கட்டிடங்கள் தொல்பொருள் ஆய்வுத் துறையின் பராமரிப்பின் கீழ் உள்ளன. கட்டபொம்மன் பயன்படுத்திய ஆயுதங்கள், அவர் காலத்து மக்கள் பயன்படுத்திய பல்வேறு பொருட்கள், அணிகலன்கள் நாணயங்கள் போன்றவை தொல்பொருள் ஆய்வுத் துறையினரால் கண்டெடுக்கப்பட்டுச் சென்னையில் தமிழ்நாடு அரசு அருங்காட்சியகத்தில் பொதுமக்கள் பார்வைக்கு வைக்கப்பட்டுள்ளன.


வீரபாண்டிய கட்டபொம்மன் அஞ்சல் தலை
மணிமண்டபம்
கட்டபொம்மன், மற்றும் ஊமைத்துரை பற்றிய நினைவு புகைப்படக் கண்காட்சியுடன் நினைவு மண்டபம் ஒன்று கட்டப்பட்டு வருகிறது.[6]

பாஞ்சாலங்குறிச்சிக்கான பயண தூரம்
தூத்துக்குடி மாவட்டத்திலுள்ள தூத்துக்குடி, எட்டயபுரம் போன்ற ஊர்களிலிருந்து பாஞ்சாலங்குறிச்சிக்கு பேருந்து வசதி உள்ளது. மேலும் சில இடங்களிலிருந்து பாஞ்சாலங்குறிச்சிக்கான தூரம்

ஒட்டப்பிடாரம் - 3 கி.மீ
எட்டயபுரம் - 23 கி.மீ
தூத்துக்குடி - 25 கி.மீ
கயத்தாறு - 40 கி.மீ
கோவில்பட்டி - 38 கி.மீ
திருச்செந்தூர் - 70 கி.மீ`,
    },
    {
      id: 6,
      name: "மன்னர் ஊமைத்துரை நாயக்கர் ",
      image: img6,
      desc: `ஊமைத்துரை  (இயற்பெயர் குமாரசாமி நாயக்கர்) (இ. நவம்பர் 16, 1801) ஒரு தென் இந்திய பாளையக்காரர் ஆவார். பாஞ்சாலங்குறிச்சி பாளையக்காரர் வீரபாண்டிய கட்டபொம்மனின் தம்பியான இவர், முதல் பாளையக்காரர் போர், மற்றும் இரண்டாம் பாளையக்காரர் போர்களில் ஆங்கிலேயரை எதிர்த்துப் போரிட்டார். முதல் போரில் பிடிபட்டுப் பாளையங்கோட்டை மத்தியச் சிறையில் ஊமைத்துரை அடைக்கப்பட்டார். 1801-ஆம் ஆண்டு பிப்ரவரி மாதம் 2 ஆம் நாளன்று இவர் ஒரு வருடத்திற்கும் மேலாக சிறைவாசத்திற்குப் பிறகு சிறையிலிருந்து தப்பித்தார்.[1] இரண்டாம் பாளையக்காரர் போரில் சிவகங்கை மருது சகோதரர்கள், தீரன் சின்னமலை, மலபார் கேரள வர்மா மற்றும் பிற தலைவர்களுடன் பிரிட்டிசு கிழக்கிந்திய கம்பெனியை எதிர்க்க ஊமைத்துரை கூட்டணி அமைத்தார்.[2] இறுதியில் ஆங்கிலேயர்களால் வீழ்த்தப்பட்டு இவரும் மருது சகோதரர்களும் தூக்கில் இடப்பட்டனர்.

வாழ்க்கைக் குறிப்பு
இவரது இயற்பெயர் குமாரசாமி. அழகிய வீரபாண்டியபுரம் எனும் ஊரில் (இன்றைய ஒட்டபிடாரம்) ஆட்சிபுரிந்து வந்த ஜெகவீரபாண்டியனின் (நாயக்க வம்சம்) அவையில் அமைச்சராக பொம்மு என்கிற கெட்டி பொம்மு (தெலுங்கு) இடம்பெற்றிருந்தார். இவரது பூர்வீகம் ஆந்திரமாநிலம், பெல்லாரி ஆகும். வீரமிகுந்தவர் என்ற பொருளை தெலுங்கில் உணர்த்தும் கெட்டி பொம்மு எனும் சொல் நாளடைவில் கட்டபொம்மு என்று மாறி பின் தமிழில் கட்டபொம்மன் என்ற சொல்லாயிற்று. ஜெகவீரபாண்டியனின் மறைவிற்குப்பின் அரசகட்டிலில் ஏறிய கட்டபொம்மு பின் ஆதிகட்டபொம்மன் என்று மக்களால் அழைக்கப்பட்டனர். இவரே பொம்மு மரபினரின் முதல் கட்டபொம்மன். .

இந்த பொம்மு மரபில் வந்தவர்களே (திக்குவிசய கட்டபொம்மன்) ஜெகவீர கட்டபொம்மன், ஆறுமகத்தம்மாள் தம்பதியர் இவர்களுக்கு மகனாகப் பிறந்தார் ஊமைத்துரை . இவர் வீரபாண்டிய கட்டபொம்மனின் தம்பி .இவருக்கு சுப்பா நாயக்கர் என்ற செவத்தையா என்ற தம்பியும் இருந்தார் .தமிழ் நாட்டார் தரவுகள் இவரது பேச்சாற்றலைப் பகடி செய்யும் வண்ணம் இவருக்கு “ஊமைத்துரை” என்று பட்டப்பெயர் வந்ததாகச் சொல்கின்றன. இவரை எதிர்த்துப் போர் புரிந்த ஆங்கிலேயத் தளபதி மேஜர் வெல்ஷின் குறிப்புகள் இவர் பேச்சுத் திறன் குன்றியவர் என்பதால் இவ்வாறு அழைக்கப்பட்டார் எனத் தெரிவிக்கின்றன.


ஊமைத்துரை ஒளிந்திருந்த குகை
இவர் ஆங்கிலேயக் கிழக்கிந்தியக் கம்பெனிக்கு எதிராகப் போர்புரிந்தார். முதல் பாளையக்காரர்கள் போரில் இவர் பிடிக்கப்பட்டு பாளையங்கோட்டைச் சிறையில் அடைக்கப்பட்டார். பின்னர் 1801-ஆம் ஆண்டு பிப்ரவரி 2ல் சிவகங்கை மாமன்னர் மருதுபாண்டியர்கள் உதவியுடன் பாளையங்கோட்டை சிறையில் இருந்து தப்பித்து சென்று வெறும் 6 நாட்களில் ஏற்கனவே இடிக்கப்பட்ட பாஞ்சாலங்குறிச்சி கோட்டையை, மீண்டும் கட்டியெழுப்பினார்..இவர் பின்னர் மருது சகோதரர்களுடன் கூட்டாகச் சேர்ந்து வெள்ளையர்களை எதிர்த்தார். மேலும் வெள்ளையர்களை எதிர்த்து உருவான, தீரன் சின்னமலை, கேரள வர்மா ஆகியோரைக் கொண்ட ஒரு பெரும் அணியிலும் இடம் பெற்றிருந்தார். இரண்டாவது போரில் அவரது கோட்டை வீழ்ந்த பின் மருது சகோதரர்களுடன் சேர்ந்து தப்பி காளையார் கோவிலில் தங்கியிருந்தார். பின்னர் காளையார் கோவிலும் ஆங்கிலேயர்களால் வீழ்த்தப்பட்டு 1801 நவம்பர் 16-ஆம் நாள் இவரும் மருது சகோதரர்களும் தூக்கில் இடப்பட்டனர்.

பண்புகள்
ஊமைத்துரை நட்புணர்வும், மனிதாபிமானமும் கொண்டுருந்தவர் என்று வரலாறு கூறுகிறது. மருது பாண்டியர், வெள்ளையத்தேவன், தீரன் சின்னமலை, விருப்பாச்சி கோபால நாயக்கர் மற்றும் எல்லைத்தகராறு காரணமாக பகையாளியாகக் கருதப்பட்ட எட்டயபுரம் பாளையக்காரர்கள் இவர்கள் அனைவரிடத்தும் நட்போடு பழகி வாழ்ந்து வந்ததாகவும், ஆங்கிலேயர்கள் பலரை அழித்த ஊமைத்துரை அவரிடம் அடைக்கலம் கேட்டு வந்த ஆங்கிலேயர்களையும் அரவணைத்து நட்போடு உபசரித்து அனுப்பினார் என்று ஆங்கிலேய ஆவணங்களில் உள்ளது

ஆங்கிலேய அதிகாரிக்கும் பரிவு
காலநெல் என்ற ஆங்கிலேயர் 1801இல் தூத்துக்குடி மாவட்டக் கம்பெனித் தளபதியாக ஆங்கிலேயர்களால் நியமிக்கப்பட்டார். அவர் தூத்துக்குடிக் கடற்கரையில் நடந்து சென்று கொண்டிருந்த நேரத்தில் ஊமைத்துரையின் படை வீரர்களால் சிறைபிடிக்கப்பட்டுப் பாஞ்சாலங்குறிச்சியில் அடைக்கப்பட்டார். அவரது மனைவி தன் கணவரை விடும்படி கேட்டுக்கொண்டதற்கு ஊமைத்துரை இசைந்தார். அவர்களுக்கு வீரவாள் பரிசாகவும் கொடுத்து, தூத்துக்குடி வரையிலும் பாதுகாப்பாகச் செல்ல குதிரைகளுடன் இரண்டு வீரர்களையும் வழித்துணையாக அனுப்பினார். ஊமைத்துரை தான் எனது நண்பர் என்றும், ஊமைத்துரையின் நட்பு, மனிதாபிமானம், வீரம் பற்றிய அனைத்தையும் கால்நெல் கடிதத்தில் குறிப்பிட்டு உள்ளார்.`,
    },
    {
      id: 7,
      name: "விருப்பாச்சி கோபால்  நாயக்கர் ",
      image: img7,
      desc: `கோபால் நாயக்கர் (இறப்பு: 20, நவம்பர், 1801[1]) தமிழ்நாட்டில் ஆங்கிலேயர்க்கு எதிரான விடுதலைப் போராட்ட முன்னோடிகளுள் குறிப்பிடத்தக்கவர். ஆங்கிலேயரைத் தமிழ் மண்ணிலிருந்து விரட்ட பதினெட்டாம் நூற்றாண்டில் பெரும்படை திரட்டி கூட்டமைப்பு அமைத்து போரிட்ட மன்னர்களில் குறிப்பிடத்தக்கவர். இவர் திண்டுக்கல்–பழநிக்கு நடுவே உள்ள விருப்பாச்சி என்ற ஊரை அன்றைய நாயக்கர்கள் பாளையம் என்ற முறையில் ஆட்சி செய்த குறுநில மன்னர்.

ஆங்கிலேயரை எதிர்த்து படை திரட்டிப் புரட்சி செய்த காரணத்தால் ஆங்கிலக் கிழக்கிந்தியக் கம்பெனியரால் 1801-ம் ஆண்டு செப்டம்பரில் தூக்கில் இடப்பட்டுக் கொல்லப்பட்டார். இவரது நினைவாலயம் விருப்பாச்சி பகுதியில் அமைந்துள்ளது.

வாழ்க்கைக் குறிப்பு
இன்றைய திண்டுக்கல் மாவட்டம் திண்டுக்கல் - பழநிக்கு செல்லும் வழியில் உள்ள விருப்பாச்சி என்னும் ஊரில் கி.பி.1725 இல் நாயக்கர் சமுதாயத்தைச் சேர்ந்த வீரய்யா நாயக்கர் - காமாட்சி அம்மாள் ஆகியோருக்கு மகனாகப் பிறந்தவர் இவர் இயற்பெயர் (திருமலை குப்பள சின்னய்யா நாயக்கர்) அல்லது திருமலை கோபால சின்னய்யா நாயக்கர் . விசுவநாத நாயக்கர் ஆட்சி காலத்தில் ஏற்பட்ட பாளையப்பட்டுகளில் ஒன்றான விருப்பாச்சியின், 19 ஆவது பாளையக்காரராக இவர் ஆட்சிக்கு வந்தார்.

குடும்பம்
கோபால் நாயக்கருக்கு பாப்பம்மாள் என்ற மனைவியும் முத்துவேல் நாயக்கர், பொன்னப்பா நாயக்கர் என்ற இரண்டு மகன்கள் இருந்தனர்.

விருப்பாச்சி பெயர் காரணம்
நங்காஞ்சிப் பகுதிக்கு வந்த விசய நகரப் பேரரசின் மன்னர் கிருஷ்ண தேவராயர் அப்பகுதி மக்களின் வீரத்தைப் பாராட்டி தனது மனைவியின் பெயரான ’விருப்பாச்சி’யை அவ்வூரின் பெயராக வைத்தார். அது முதல் நங்காஞ்சி என்ற ஊர் விருப்பாச்சி என மாறியது.

கூட்டமைப்பு
விருப்பாச்சி பாளையக்காரராக விளங்கிய கோபாலநாயக்கர் கண்காணிப்பில், புரட்சிப்படையினர் ஆங்கில முகாம்களில் பாய்ந்து ஆயுதங்களையும் சேமிப்புப் பண்டங்களையும் பறித்தனர். மருதுபாண்டியருடனும் (அண்டை தேசத்து) கன்னட மராட்டிய பகுதி மன்னரான துந்தாசிவாக்குடனும் தொடர்பு கொண்டு ஒரு விரிவான கூட்டமைப்பு ஒன்றை உருவாக்கினார். இது தீபகற்ப கூட்டமைப்பு என்றழைக்கப்பட்டது, மருதுபாண்டியர்கள் தலைமையில் சிவகங்கைச் சீமையும், அதேபோல் கோபால நாயக்கர் தலைமையில் திண்டுக்கல்லும் கூட்டமைப்புடன் சேர்ந்து வலுப்பெற்றன. கன்னட தேசத்தில் தூந்தாசிவாக்கும் கிருட்டிணப்பநாயக்கரும், மலபாரில் கேரளவர்மனும் கூட்டுப்படை மூலம் ஆங்கிலேயரை எதிர்த்தனர். கோயம்புத்தூரிலும் சேலத்திலும் கூட்டுபடையினர் இயங்கினர். ஈரோட்டு மூதார்சின்னனும், கானிசாகனும் தலைவர்களாகத் திகழ்ந்தார்கள். மணப்பாறை லட்சுமி நாயக்கரும் , தேவதானப்பட்டி பூசாரி நாயக்கரும் தங்களது போர் வீரர்களைக் கோபால நாயக்கருக்குக் கொடுத்து உதவி வந்து உள்ளனர் . பழனியில் இத்தலைவர்களின் தூதர்கள் கோபால நாயக்கர் தலைமையில் கூடிப் பேசினார்கள். விருப்பாட்சியில் தெற்கத்திச் சீமையின் சுமார் 3000 கிராமங்களின் பிரதிநிதிகள் ஒன்றுகூடி வெள்ளையர்களை விரட்டுவதற்குச் சபதம் எடுத்தார்கள். இந்த அறைகூவல் கிராமங்கள் தோறும் பனையோலை மூலம் எடுத்துச் செல்லப்பட்டது. தீபகற்பக் கூட்டமைப்பு தலைமையில் மக்கள் திரளாகப் பங்கேற்ற முதல் சுதந்திரப்போர் தொடங்கியது.

முதல் போர்
கி.பி.1799 மார்ச்சில் கோபால்நாயக்கர் வழி காட்டுதலின் படி மணப்பாறை லட்சுமிநாயக்கர், ஆங்கிலேயரை எதிர்த்து போரிட்டு நத்தம், மேலூர்,மணப்பாறை ஆகிய பகுதிகளை கைப்பற்றினர்.

ஆங்கிலேயர் எச்சரிக்கை

செப்புப் பட்டயம்
கி.பி.1799 அக்டோபரில் வீரபாண்டிய கட்டபொம்மனைத் தூக்கிலிடப்பட்ட பின் விருப்பாச்சி அரண்மனைக்கு மேஜர் ஐ. ஏ. பானர்மேன் எச்சரிக்கை செப்புப் பட்டயம் ஒன்றை அனுப்பினார். அதில் "கும்பனியருக்கு எதிராகப் புரட்சியில் ஈடுபட்டால் கட்டபொம்மனைப் போல் தூக்கிலிட்டு கொல்லப்படுவர்" என்ற செய்தி இருந்தது. தற்போது இடையகோட்டை ஜமீன் அரண்மனையில் இச்செப்புப் பட்டயம் பாதுகாப்பாக உள்ளது.

ஆங்கிலேயரை எதிர்த்தார்
ராணி வேலுநாச்சியாருக்கும், ஊமைத்துரைக்கும் அடைக்கலம் கொடுத்ததால் வெள்ளையர்கள், கோபால நாயக்கர் மீது ஆத்திரம் அடைந்தனர். இந்நிலையில், கி.பி.1800ல் வெள்ளையர்களை எதிர்த்து ஒரு அணி திரட்டி கோவை மீது படையெடுத்துச் சென்றார்.

கோவைத் தாக்குதல்
கி.பி.1800 ஏப்ரலில் கோபால்நாயக்கர் தலைமையில் இறுதிக்கட்டப் போருக்கு திட்டமிட்டனர். இக்கூட்டத்தில் கேரளவர்மா, மைசூர் கிருட்டிணப்பா, சிவகங்கை சின்னமருது, கோவை ஹாஜிஹான், இராமநாதபுரம் கல்யாணித்தேவர், மற்றும் பெருமாள் பிள்ளை ஆகியோர் கலந்து கொண்டனர். கி.பி.1800 சூனில் கோவையிலுள்ள ஆங்கிலேயரின் ராணுவ முகாமை நாலாபுறமும் இருந்து ஒரே சமயத்தில் தாக்குவது என முடிவெடுத்தனர். அதன்படி ஓசூர் புட்டா முகமது, இச்சாபட்டி ராமனுல்லாகான், ஓசூர் முஹமது ஹாசன், பரமத்தி அப்பாவு, சேசையா ஆகியோர் தளபதிகளாக இருப்பது எனவும் முடிவெடுத்தனர். இச்செய்தி ஆங்கிலேயருக்கு எட்டியது. ஆங்கிலேயர் நாலாபுறமும் பீரங்கிப்படையை நிறுத்தி புரட்சிப்படைகளைச் சுற்றி வளைத்துக் கைது செய்தனர். அவர்கள் கொடுமையான முறையில் படுகொலை செய்யப்பட்டனர். தளபதி முகமதுஹாசன் சேலம் கலெக்டர் மக்லாய்டு செய்த சித்ரவதையினால் கூட்டணி இரகசியம் போய்விடக்கூடாது என எண்ணித் தனது கழுத்தைத் தானே அறுத்துக்கொண்டார்.

இறுதிப் போர்

சத்திரப்பட்டி அரண்மனை
கோவை தாக்குதலுக்குப் பின் கி.பி.1800 அக்டோபரில், ஆங்கிலப்படை லெப்டினட் கர்னல் இன்னஸ் பெரும் படையுடன் விருப்பாச்சியை முற்றுகையிட்டான். விருப்பாச்சி, இடையகோட்டை, வேலுர், பாளையத்தைச்சேர்ந்த மக்களும் ஏனைய பாளையத்தின் போர் வீரர்களும் சத்திரபட்டி பாளையத்தின் அரண்மனை முன்பு போர் புரிந்தனர். போரில் கோபால் நாயக்கரின் மூத்த மகன் முத்துவேல் நாயக்கர் கொல்லப்பட்டார். கோபால் நாயக்கர் தப்பிவிட்டார். கர்நாடக, மராட்டிய படைத் தளபதி தூந்தாசிவாக்கை கைது செய்து பீரங்கியின் வாயில் கட்டிவைத்தனர். தொடர்ந்து கோபால் நாயக்கரின் மனைவி பாப்பம்மாள், இளைய மகன் பொன்னப்ப நாயக்கர் உட்பட 22 பேரை திண்டுக்கல்லில் கி.பி.1816 வரை சிறைவைத்தனர். கோபால்நாயக்கர் தலைக்கு அந்த காலத்திலேயே 20,000 ரூபாய் என அறிவித்தனர். பணத்திற்காக துரோகிகள் காட்டிக் கொடுத்தனர். கி.பி.1801செப்டம்பர் மாதத்தில் திண்டுக்கல் ஊருக்கு வெளியே குளக்கரையில் புளிய மரத்தில் தூக்கிலிட்டனர். அந்தக் குளம் கோபாலநாயக்கர் சமுத்திரம் என நகரின் மத்தியில் இன்றும் உள்ளது.[2]

கோபால்நாயக்கர் அரண்மனை

இடிந்த அரண்மனை
கோபால்நாயக்கரின் அரண்மனையையும், அவரது மனைவிக்காக கட்டிய அந்தப்புரத்தையும் இடித்து தரைமட்டமாக்கினர். அரண்மனையின் சுவர்களின் அடித்தளம் 45 அடி நீளமுள்ளது மட்டும் இன்றும் உள்ளது. அரண்மனை முன்பு யானை கட்டும் நடு கல், குதிரைகள் தண்ணீர் குடிக்கும் கருங்கல் தொட்டி, இன்றும் காணமுடிகிறது.

கள ஆய்வு
கோபால நாயக்கர் வாழ்ந்த விருப்பாச்சி பகுதியில் தமிழக அரசின் சார்பில் கள ஆய்வு மேற்கொண்டு, அரண்மனை வளாக அமைவிடம் கண்டறியப்பட்டது. கள ஆய்வில் அரண்மனையின் எச்சங்கள், ஐந்து ஏக்கர் பரப்பளவில் பரவிக் கிடப்பது உறுதி செய்யப்பட்டது. இதில், கோவிலின் சிதிலங்கள், பயன்படுத்திய மண் பாண்டங்கள், பீங்கான்கள், கண்ணாடியால் ஆன பொருட்கள் ஆய்வில் சேகரிக்கப்பட்டன. இரும்பை உருக்கி ஆயுதங்கள் செய்ததற்கான தடயங்களும் சேகரிக்கப்பட்டன. இந்த ஆயுதங்களை வெள்ளையர்களுக்கு எதிரான போராட்டத்தில் பயன்படுத்தி இருக்கலாம் என்பது கள ஆய்வின் மூலம் அறியப்படுகிறது.

நினைவிடம்

மணிமண்டபம்
ஆங்கிலேயர்களை எதிர்க்க திண்டுக்கலில் இருந்து கூட்டமைப்பு திரட்டி , ராணி வேலுநாச்சியார்க்கும், ஊமைத்துரைக்கும் போராட்ட காலத்தில் உதவி வந்தும் படை வீரர்களை அவர்களுக்குக் கொடுத்து உதவியும் , கேரளா வர்மா , தூந்தாசிவாக் ,என்று பலரிடமும் இணக்கத்தோடு இருந்து ஆங்கிலேயர்களை நாட்டை விட்டு விரட்ட வேண்டும் என்ற ஒரே நோக்கில் பாடுபட்ட திருமலை கோபால சின்னப்பா நாயக்கருக்குத் தமிழக அரசின் சார்பில் மணிமண்டபம் கட்டி உள்ளனர். திண்டுக்கல் - பழனி தேசிய நெடுஞ்சாலையில் அமைந்துள்ள இந்த மணிமண்டபம் 69 லட்சம் செலவில் 0.24.00 ஹெக்டேர் பரப்பளவில் அமைந்துள்ளது`,
    },

    {
      id: 8,
      name: "ஜி.டி.நாயுடு  ",
      image: img8,
      desc: `கோபால்சாமி துரைசாமி பலரால் ஜி. டி. நாயுடு என்று அறியப்படுபவர் (G. D. Naidu, மார்ச் 23, 1893 -சனவரி 4, 1974) தமிழகத்தின் அறிவியல் துறையில் சாதனைகள் படைத்தவர். இயந்திரவியல், விவசாயம் சார்ந்த துறைகளில் எண்ணற்ற ஆராய்ச்சிகளை செய்தவர்.

வாழ்க்கை
துரைசாமி தமிழ்நாட்டின், கோயம்புத்தூர் மாவட்டம், கலங்கல் கிராமத்தில் பிறந்தார். இளம் வயதில் படிப்பில் அதிக நாட்டம் இல்லாதவராய் இருந்த போதும் தனக்கு விருப்பமான நூல்களையெல்லாம் வாங்கிப் படித்து அறிவுத்திறனை வளர்த்துக்கொண்டார்.

தனித் திறன்கள்
இளம் வயதில் துரைசாமி கோவையிலிருந்த ஒரு மோட்டார் தொழிற்சாலையில் பணிக்கு சேர்ந்தார்.

வேலையை விட்டுவிட்டு தன்னுடைய ஊதியத்திலிருந்து சேமித்து வைத்திருந்த பணத்துடன் நண்பர்களிடம் கடன் பெற்று திருப்பூரில் ஒரு பருத்தித் தொழிற்சாலையை நிறுவினார்.

அப்போது முதலாம் உலகப் போர் துவங்கிய காலமாயிருந்ததால் அவருடைய பருத்தி தொழில் சூடு பிடித்தது. அவருடைய வர்த்தகத் திறமையால் குறுகிய காலத்திலேயே திருப்பூரில் விரல் விட்டு எண்ணக்கூடிய லட்சாதிபதிகளில் ஒருவரானார்.

ஆரம்பத் தோல்விகள்
பின்னர் பம்பாய் சென்று பருத்தி வியாபாரத்தை தொடர்ந்தார். பம்பாய் பருத்தித் தரகர்களுக்கு ஈடுகொடுக்க முடியாமல் கையிருப்பை முழுவதும் இழந்து ஊர் திரும்பினார்.

ஆனால் மனந்தளராமல் மோட்டார், லாரி, பேருந்து போக்குவரத்தில் ஈடுபட்டிருந்த ஸ்டேன்ஸ் துரையிடம் பணிக்கு சேர்ந்தார். அவர் துரைசாமியின் திறமையைப் பற்றி கேள்விப்பட்டிருந்ததால் ஒரு பேருந்தைக் கடனாக கொடுத்து தவணை முறையில் கடனைத் திருப்பி அடைத்தால் போதும், அதுவரை தினமும் வசூலாகும் தொகையில் ஒரு பகுதியை தனக்கு அளிக்க வேண்டும் என்றார்.

முதலாளியும் தொழிலாளியுமாக இருந்து முதன் முதலில் பொள்ளாச்சிக்கும் பழனிக்கும் பேருந்தை இயக்கினார் துரைசாமி.

சாதனைகள்
தனி முதலாளியாக இருக்க விரும்பாமல் வேறு சிலரையும் கூட்டு சேர்த்துக்கொண்டு யுனைடெட் மோட்டார் சர்வீசு என்ற நிறுவனத்தை துவக்கினார். அந்நாளிலேயே பயணிகளுக்கான வசதிகள், ஓட்டுனர்களுக்கு தங்கும் இடம் போன்று வசதிகளை செய்து காட்டினார்.

முதன் முதலாக அவருடைய நிறுவனத்தைச் சேர்ந்த பேருந்துகள் வந்து, புறப்படும் நேரத்தைக் காட்டும் கருவி ஒன்றைக் கண்டுபிடித்து பேருந்து நிலையங்களில் வைத்து சாதனைப் படைத்தார். பயணச்சீட்டுகள் வழங்குவதற்கு அந்த காலத்திலேயே ஒரு இயந்திரத்தை தன்னுடைய சிறிய தொழிற்சாலையிலேயே தயாரித்து பயன்படுத்தினார்.

இத்தகைய கண்டுபிடிப்புகள் இவரே உருவாக்கியவை. பல்கலைக்கழகப் படிப்பில்லாதிருந்தும் அறிவியல் துறையில் பல சாதனைகளை படைத்தார்.

அடிக்கடி தண்ணீர் ஊற்ற வேண்டிய தேவை இல்லாத வகையில் மோட்டார் ரேடியேட்டருக்கு இணையான ஒரு இயந்திரத்தைக் கண்டுபிடித்து அதை தன் பேருந்துகளில் பயன்படுத்தினார்.

எஞ்சின் ஓடிக்கொண்டிருக்கும்போதே அதன் அதிர்வு விகிதம் அதிகமா, குறைவா என்பதைக் கண்டுபிடிக்க அதிர்வு சோதிப்பான் (Vibrator Tester) என்ற இயந்திரத்தை கண்டுபிடித்தார்.

அவர் செய்து வந்த மோட்டார் வாகனத் துறைக்கு முற்றிலும் மாறுபட்ட துறைகளிலும் அவருடைய கண்டுபிடிப்புகள் தொடர்ந்தன.

புகைப்படத் துறையில் பிற்காலத்தில் மிகவும் உதவியாயிருந்த டிஸ்டன்ஸ் அட்ஜஸ்டர் என்ற கருவி, பழச்சாறு பிழிந்தெடுக்க ஒரு கருவி, எந்தவித வெட்டுக்காயமுமின்றி முகச்சவரம் செய்துகொள்ள பிளேடு என அவருடைய கண்டுபிடிப்புகள் தொடர்ந்தன.[3]

துரைசாமி தயாரித்த பிளேடுகளைத் தானே தயாரித்துக்கொள்ள ஒரு அமெரிக்க நிறுவனம் விருப்பம் தெரிவித்து அதன் காப்புரிமத்தை ஒரு லட்சம் டாலருக்கு விற்கும்படி கேட்டும் அவர் சம்மதிக்கவில்லை. தமிழகத்திலேயே அவற்றைத் தயாரிக்கும் எண்ணத்தில் அதற்குத் தேவையான எஃகை நார்வே நாட்டிலிருந்து தருவிக்க பெரும் முயற்சியெடுத்தார். ஆனால் அவரது முயற்சி கைகூடவில்லை. பல தடைகளால் இவரின் அரும்பெரும் கண்டுபிடிப்புகள் காப்புரிமம் செய்ய முடியாமலே போய்விட்டன.


1936ஆம் ஆண்டு ஜெர்மன் நகரில் நடைபெற்ற பொருட்காட்சியில் அவருடைய கண்டுபிடிப்புகளில் ஒன்றான பிளேடுக்கு மூன்றாவது பரிசு
ஜெர்மன் நகரில் நடைபெற்ற பொருட்காட்சியில் அவருடைய கண்டுபிடிப்புகளில் ஒன்றான சவரக் கத்தி, பிளேடு ஆகியவற்றிற்கு முறையே முதல் பரிசும், மூன்றாவது பரிசும் கிடைத்தன. "பல நிறுவனங்கள் இவருடைய கண்டுபிடிப்புகளுக்கு உரிமையைக் கேட்டும் வழங்க மறுத்து அவற்றை நம் நாட்டிலேயே தயாரிக்க இந்திய அரசிடம் நிதியைக் கோரினார். ஆனால் இந்திய அரசாங்கம் இவருடைய கோரிக்கைக்கு செவிமடுக்காததால் அதுவும் செயல்படுத்தப்படாமல் போனது. இதனால் மனம் உடைந்துப்போன துரைசாமி ஒரு அமெரிக்க நிறுவனம் அவருடைய கண்டுபிடிப்பிற்கு பத்து லட்சம் கொடுக்க முன்வந்தும் அதன் உரிமையை இலவசமாகவே வழங்கிவிட்டார்". அதற்கு அவர் கூறிய காரணம்: ‘ஒரு அமெரிக்க நிறுவனத்திடமிருந்து பத்து லட்சம் ரூபாயை வாங்கி இந்திய ஆங்கிலேய அரசுக்கு ஒன்பது லட்சம் வரி செலுத்துவதைவிட இலவசமாக கொடுப்பதே மேல்.’

மேலும், தன்னால் கண்டுபிடிக்கப்பட்டவைகள் எல்லாம் தம் தேசத்திற்கு முழுவதும் சொந்தமாக வேண்டும் என்ற எண்ணத்தில்தான் அவற்றை தன் பெயரில் பதிவு செய்துகொள்ளாமல் வைத்திருக்கிறேன் என்றும் இந்தியர்கள் யாராயிருந்தாலும் அவற்றை இலவசமாக பயன்படுத்தலாம் என்றும் பகிரங்க அறிக்கை விட்டார்.

துரைசாமியின் கண்டுபிடிப்புகள் பலவும் அதிக அளவில் நாட்டுக்கு பயன்படாமல் போனதற்கு வேறொரு காரணம் அன்றைய அரசு அவர்மேல் திணித்த அதிகபட்ச வரி. அன்றைய சூழலில் நாட்டிலேயே அதிக வரி செலுத்தியவர்களில் ஒருவராயிருந்தும் அவர்மேல் வரி ஏய்ப்பு செய்பவர் என்ற அவப்பெயரும் சுமத்தப்பட்டது.

எனவே, மனம் உடைந்துப் போய் அரசாங்கத்துக்கு கொடுப்பதைக் காட்டிலும் வெறுமனே இருந்துவிட்டு போய்விடுவேன். இனி ஒரு பைசா கூட வருமான வரியென்ற பெயரால் செலுத்த மாட்டேன், என்று சபதமெடுத்தார்.

அவருடைய கண்டுபிடிப்புகள் இயந்திர, மோட்டார் தொழிலில் மட்டுமல்லாமல் விவசாயத்திலும் பல வியக்கத்தக்க சாதனைகளைப் புரிந்தார்.

விதைகளில்லா நார்த்தங்காய், ஆரஞ்சு பழம் ஆகியவை இவருடைய கண்டுபிடிப்புகளில் சில. அடுத்து, சோளச்செடிகளுக்கு ஊசி மூலம் மருந்து செலுத்தி நட்ட சிறிது காலத்திலேயே 26 கிளைகளுடன் 18 1/2 அடி உயரத்திற்கு வளரச் செய்தார்! சாதாரண சோளச்செடியில் மூன்று அல்லது நான்கு கதிர்கள்தான் இருந்தன. ஆனால் துரைசாமியின் அதிசய செடிகளில் 39 கதிர்கள்வரை இருந்தன!

அதன் பிறகு பருத்திச் செடி, துவரைச் செடி என அவருடைய ஆராய்ச்சி தொடர்ந்தது.

அவர் கண்டுபிடித்த தாவர ஆராய்ச்சி முடிவுகள் அமெரிக்கர்களையே பிரமிக்க வைத்தன. ஜெர்மானியர்கள அவருடைய அதிசய பருத்திச் செடிக்கு ‘நாயுடு காட்டன்’ என்ற பெயர் சூட்டி கவுரவித்தனர். ஆயினும் இந்திய அரசாங்கம் அவரை கண்டுகொள்ளவேயில்லை.

சமூக சேவைகள்
1938–ஆம் ஆண்டு, துரைசாமி தன்னுடைய போக்குவரத்து நிறுவனத்திற்கு சொந்தமான பதினெட்டு லட்சம் ரூபாய் மதிப்புள்ள பேருந்துகளை கோவை வட்டார கழகத்தாரிடம் இலவசமாக ஒப்படைத்தார்.

இந்திய இளைஞர்கள் தொழில் நிபுணர்களாக உருவெடுத்து நாட்டுக்கு பயன் பெற வேண்டுமென்று விரும்பி அவர்கள் படிப்பதற்கு தன்னால் இயன்ற அளவுக்கு பொருளுதவி செய்தார். தொழிற்கல்வி மட்டுமே இன்றைய இந்தியாவிற்குத் தேவை என்பதை தன் உதவியை நாடி வந்த இளைஞர்களை அறிவுறுத்தினார்.

அத்துடன் நின்றுவிடாமல் தன்னுடைய சுயமுயற்சியினால் பாலிடெக்னிக் மற்றும் பொறியியல் கல்லூரிகளை துவக்கினார். அக்கல்லூரி தற்போது அரசினர் தொழில்நுட்பக் கல்லூரி, கோயம்புத்தூர் (GCT) என அறியப்படுகிறது.

இவருடைய மகன் ஜி.டி. கோபாலையும் கலைக்கல்லூரிக்கு அனுப்பாமல் தொழிற் கல்வி படிக்கச் செய்தார். அவர் இப்போது தன் தந்தை உருவாக்கிய தொழில் நிறுவனங்களை கவனித்துக் கொள்கிறார்.

துரைசாமியின் வெளிநாட்டு சுற்றுப் பயணத்தின்போது பல நிறுவனங்கள் பயிற்சி அளிக்கும் சாதனங்களையும், கருவிகளையும் இவருடைய கல்லூரிக்கு இலவசமாக அளித்தன.

இந்தியாவிலேயே முதன் முதலாக மின்சார மோட்டார் உற்பத்தி செய்யும் தொழிற்சாலை கோவையிலேயே துவக்கப்பட்டது என்ற பெருமை அவரையே சாரும்.

பாராட்டுகள்
துரைசாமியின் அறிவுத்திறன், அவருடைய தாராள மனப்பான்மை, எளியவர்க்கு உதவும் நற்குணம் ஆகியவற்றைப் பல தலைவர்கள் பாராட்டியுள்ளனர்.

‘இவர் தமிழகத்திற்கு ஒரு நிதி. இவரது புகழ் உலகெங்கும் பரவ வேண்டும்’ என்றார் பெரியார்.

‘துரைசாமியின் அறிவை நம் சமுதாயம் முழு அளவில் பயன்படுத்திக் கொள்ளவில்லை. அவருடைய கண்டுபிடிப்புகள் ஒரு அளப்பரிய மதிப்புடைய கருவூலங்கள்’ என்றார் அண்ணா. 'கோவை வாசிகள் தங்களுடைய கல்வியிலும், முன்னேற்றத்திலும் மிகுந்த அக்கறை கொண்டிருக்கும் துரைசாமியைக் கண்டு பெருமை கொள்ள வேண்டும். இப்படிப்பட்ட மனிதருடன் வசிக்க நாம் எவ்வளவு பெருமை கொள்ள வேண்டும்’ என்று மனம் திறந்து பாராட்டினார் சர். சி. வி. ராமன்.

அவினாசி சாலையில் அமைந்துள்ள கோபால் பாக்கில் அமைக்கப்பட்டுள்ள நிரந்தரப் பொருட்காட்சி இவருடைய அறிவுத்திறனை இன்றும் பறைசாற்றிக் கொண்டிருக்கின்றது.

நூல்கள்
உழைப்பால் உயர்ந்த ஜி.டி.நாயுடு (மெர்வின்)`,
    },
     
    {
      id: 9,
      name: "நாராயணசாமி நாயுடு ",
      image: img9,
      desc: `நாராயணசாமி நாயுடு (திசம்பர் 6, 1925 - திசம்பர் 20, 1984) தமிழக உழவர் இயக்கத்தின் (தமிழக விவசாயிகள் சங்கம்) நிறுவனர் மற்றும் தலைவர்.

வாழ்க்கைக் குறிப்பு
தமிழ்நாடு கோயம்புத்தூர் மாவட்டம் அவிநாசி வட்டம் செங்காளிபாளையம் கிராமம் வையம்பாளையம் என்ற சிற்றூரில் எளிய வேளாண் குடும்பத்தில் பிறந்தார் நாராயணசாமி. பெற்றோர் சின்னம்ம நாயுடு - அரங்கநாயகி. ஐந்தாம் வகுப்பு வரை மட்டுமே படித்த நாராயணசாமி அதன் பிறகு தன்னை முழுமையாக உழவுத் தொழிலில் ஈடுபடுத்திக் கொண்டார். 1957 முதலே உழவர்களின் போராட்டங்களில் கலந்து கொண்டார் நாராயணசாமி. உழவர்கள் தனித்து இருப்பதாலேயே தங்கள் கோரிக்கையில் வெற்றி பெற முடிவதில்லை என்பதை உணர்ந்து உழவர்கள் இயக்கத்தை கட்டமைப்பதிலே கவனம் செலுத்தினார். 1968-ல் கோவை வட்ட உழவர் இயக்கம் 1969-ல் கோவை மாவட்ட உழவர் இயக்கம், 1970-ல் தமிழக உழவர் இயக்கம் என உழவர் இயக்கத்தை தமிழகம் முழுவதும் கட்டமைத்தார்.

1970-லிருந்து 1980 வரை தமிழகத்தில் நடைபெற்ற உழவர்களின் போராட்டத்திற்கு தலைமை ஏற்று நடத்தினார் நாராயணசாமி. உழவர் போராட்டங்களிலே கலந்து கொண்டதற்காக பல முறை சிறை சென்றார். 1980-க்கு பிறகு இந்திய அளவில் உழவர்களை திரட்டுவதற்கான முயற்சியில் ஈடுபட்டார் நாராயணசாமி. அதன் அடிப்படையில் கர்நாடகாவில் பேராசிரியர் நஞ்சுண்ட சாமியையும், ஆந்திராவில் சங்கர் ரெட்டியையும் மராட்டியத்தில் சரத் ஜோசியையும் உத்தரப்பிரதேசத்தில் மகேந்திர சிங் திகாயத்தையும் சந்தித்து உழவர் இயக்கத்தை கட்டமைக்க தூண்டினார். அதன் பிறகே இம்மாநிலங்களில் உழவர் இயக்கங்கள் ஏறபடுத்தப்பட்டன.

கோரிக்கைகள்
1970-களில் நாராயணசாமி முன் வைத்த முதன்மையான கோரிக்கைகளில் சில:-

உழவுக்கான மின்சாரம் கட்டணமின்றி வழங்கப்பட வேண்டும்.
கட்ட இயலாத நிலையில் உள்ள உழவர்களின் வங்கிக் கடனை தள்ளுபடி செய்ய வேண்டும்.
வேளாண் பொருட்களுக்கு அரசு அடிப்படை விலை நிர்ணயம் செய்ய வேண்டும்.
வேளாண்மையை ஒரு தொழிலாக அங்கீகரிக்க வேண்டும்.
`,
    },
  ];

  return (
    <section
      className="py-16 px-4 md:px-10 bg-gradient-to-b from-[#fff8f1] via-[#ffe7d2] to-[#fff8f1]"
    >
      <motion.h1
        className="text-4xl md:text-5xl font-bold text-center mb-14 text-[#d9534f]"
        initial={{ opacity: 0, y: -30 }}
        whileInView={{ opacity: 1, y: 0 }}
        transition={{ duration: 1 }}
      >
        வரலாற்று சிறப்புமிக்க தலைவர்கள்
      </motion.h1>

      {/* Main Layout */}
      <div className="flex flex-col space-y-24">
        {leaders.map((leader, index) => (
          <motion.div
            key={leader.id}
            className={`flex flex-col md:flex-row items-center justify-between gap-10 ${
              index % 2 !== 0 ? "md:flex-row-reverse" : ""
            }`}
            initial={{ opacity: 0, y: 50 }}
            whileInView={{ opacity: 1, y: 0 }}
            transition={{ duration: 0.8, ease: "easeOut" }}
          >
            {/* Leader Image */}
            <motion.div
              className="md:w-1/2 flex flex-col items-center cursor-pointer"
              whileHover={{ scale: 1.05 }}
              onClick={() => setSelected(leader)}
            >
              <img
                src={leader.image}
                alt={leader.name}
                className="rounded-3xl shadow-xl border-4 border-[#ffd3c2] object-cover object-top w-[400px] h-[400px]"
              />
              <h2 className="text-2xl font-bold mt-4 text-[#e65e10ff]">{leader.name}</h2>
            </motion.div>

            
  {/* Short Desc */}
  <div className="h-[280px] md:w-[60%] bg-white/80 p-8 rounded-3xl shadow-lg border border-[#ffe2c9] text-justify">
    <p className="text-gray-700 text-lg leading-relaxed font-medium">
      {leader.desc.slice(0, 300)}...
    </p>
    <button
      onClick={() => setSelected(leader)}
      className="mt-3 text-[#e65e10ff] font-semibold underline hover:text-[#b84b0e]"
    >
      Read More
    </button>
  </div>
          </motion.div>
        ))}
      </div>

      {/* Modal for Full View */}
      <AnimatePresence>
        {selected && (
          <motion.div
            className="fixed inset-0 bg-black/60 backdrop-blur-md flex items-center justify-center z-50"
            initial={{ opacity: 0 }}
            animate={{ opacity: 1 }}
            exit={{ opacity: 0 }}
          >
            <motion.div
              className="bg-white p-8 rounded-3xl shadow-2xl max-w-4xl w-[95%] text-center overflow-y-auto max-h-[90vh]"
              initial={{ scale: 0.8, y: 100 }}
              animate={{ scale: 1, y: 0 }}
              exit={{ scale: 0.8, y: 100 }}
              transition={{ duration: 0.5 }}
            >
             {/* ✅ Top-right Close Button — stays fixed */}
        <div className="sticky top-0 flex justify-end z-0">
          <button
            onClick={() => setSelected(null)}
            className="text-gray-600 hover:text-red-500 transition text-3xl font-bold bg-white/80 rounded-full px-2"
            aria-label="Close"
          >
            &times;
          </button>
        </div>
              <img
                src={selected.image}
                alt={selected.name}
                className="w-72 h-72 object-cover object-top rounded-3xl mx-auto border-4 border-[#eb3300] shadow-xl"
              />
              <h2 className="text-3xl font-bold mt-4 text-[#d9534f]">{selected.name}</h2>

              <p className="text-gray-700 text-lg mt-5 text-justify leading-relaxed whitespace-pre-line">
                {selected.desc}
              </p>


              <button
                onClick={() => setSelected(null)}
                className="mt-6 bg-[#e65e10ff] text-white px-6 py-2 rounded-full hover:bg-[#b84b0e] transition"
              >
                Close
              </button>
            </motion.div>
          </motion.div>
        )}
      </AnimatePresence>
    </section>
  );
};

export default SuccessGallery;
